# MassGrossSurfaceArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassGrossSurfaceArea Property
ParameterTypeId Class See Also
---
"Gross Surface Area"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassGrossSurfaceArea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassGrossSurfaceArea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassGrossSurfaceArea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace